'''
Задача 3

Напишите функцию, которая принимает один параметр (год) и определяет, является ли этот год високосным.
Напомним, что високосными годами считаются те, порядковый номер которых либо кратен 4, но при этом не кратен 100,
либо кратен 400 (например, 2000-й год являлся високосным, а 2100-й будет не високосным годом).
Программа должна корректно работать на числах 1900 ≤ n ≤ 3000.
Функция должна вывести на экран "Високосный" в случае, если год является високосным и "Обычный" в противном случае.

'''

def leap_year(inp_year):
